internal class Program
{
    private static void Main(string[] args)
    {
        //полезные NuGet пакеты

        //AutoFixture - автоматическое создание списка объектов указанного типа

        //FluentAssertions - сравнение объектов менжду собой в списках (в том числе по полям объектов)

        //Moq - создание виртуального объекта указанного класса и начначение возвращаемых у методов данного класса
        //Также можно создать виртуальные списки для полей виртуального класса для подмены баз данных
    }
}